#### case study1: opening a car showroom (descriptive analysis)
#### case study2:loan approval model(Data cleaning [filling NA values])

In [6]:
import pandas as pd
import numpy as np

In [8]:
df=pd.read_csv('income.csv')

In [10]:
df

        Name  Monthly Income ($)
0        Rob                5000
1      Rafiq                6000
2       Nina                4000
3      Sofia                7500
4      Mohan                8000
5        Tao                7000
6  Elon Musk            10000000

#### median:
- 50th percentile is median
- outlier:it is a datapoint that is very different than the rest of data points like this.
  -  6	Elon Musk	10000000
- IQR(inter quartile range) : range between 25th percentile and 75th percentile
-How the percentile use in data science??
- -> for outlier removal

#### Mode:
- most frequently occuring value in dataset

### Task : use percentile to remove outlier

In [15]:
df.describe()

       Monthly Income ($)
count        7.000000e+00
mean         1.433929e+06
std          3.777283e+06
min          4.000000e+03
25%          5.500000e+03
50%          7.000000e+03
75%          7.750000e+03
max          1.000000e+07

In [17]:
df = df.rename(columns={'Monthly Income ($)': 'income'})
df

        Name    income
0        Rob      5000
1      Rafiq      6000
2       Nina      4000
3      Sofia      7500
4      Mohan      8000
5        Tao      7000
6  Elon Musk  10000000

In [19]:
df.income.quantile(0.75)

7750.0

In [21]:
df.income.quantile(0.25)
#we can give interpolation as 'highr' or 'lower'

5500.0

In [23]:
df.income.quantile(0.25,interpolation='higher')

6000

In [25]:
df.income.quantile(0.25,interpolation='lower')

5000

In [27]:
df.income.quantile(0)

4000.0

In [29]:
df.income.quantile(0.50)

7000.0

In [31]:
df.income.quantile(1)

10000000.0

- to remoove outlier use quantile which is greater than 0.99 and then discard it

In [34]:
percentile_99=df.income.quantile(0.999)
percentile_99

9940048.000000007

In [92]:
df[df.income>percentile_99]

        Name    income
6  Elon Musk  10000000

In [96]:
df_no_outlier=df[df.income<=percentile_99]
df_no_outlier

    Name  income
0    Rob    5000
1  Rafiq    6000
2   Nina    4000
3  Sofia    7500
4  Mohan    8000
5    Tao    7000

### Task 2: filling missing values

In [99]:
#lets make one row NaN
df['income'][3]=np.NaN

C:\Users\ishwa\AppData\Local\Temp\ipykernel_17708\1927046482.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['income'][3]=np.NaN

In [111]:
df

        Name      income
0        Rob      5000.0
1      Rafiq      6000.0
2       Nina      4000.0
3      Sofia         NaN
4      Mohan      8000.0
5        Tao      7000.0
6  Elon Musk  10000000.0

- in real life we may have null values because of transmission error, data is not available

In [115]:
df.income.mean()

1671666.6666666667

In [117]:
df.fillna(df.income.mean())

        Name        income
0        Rob  5.000000e+03
1      Rafiq  6.000000e+03
2       Nina  4.000000e+03
3      Sofia  1.671667e+06
4      Mohan  8.000000e+03
5        Tao  7.000000e+03
6  Elon Musk  1.000000e+07

In [119]:
df.fillna(df.income.median())

        Name      income
0        Rob      5000.0
1      Rafiq      6000.0
2       Nina      4000.0
3      Sofia      6500.0
4      Mohan      8000.0
5        Tao      7000.0
6  Elon Musk  10000000.0

- when we do median instead of mean value looks resonable ,so whenever there is outlier we should use median instead of mean